toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static void Run() {
        // Reset our state
        Reset();
        
        // Init SPI peripheral
        _SPI::Init();
        
        // Init Triggers
        const Time::Instant startTime = _RTC::Now();
        _Triggers::Init(startTime);
        
        // Fast-forward through events
        if (Time::Absolute(startTime)) {
            for (;;) {
                _Triggers::Event* ev = _Triggers::EventFront();
                if (!ev || (ev->time > startTime)) break;
                _EventHandle(_EventPop());
            }
        }
        
        _State.live = true;
        
        // Schedule _EventTimer for the first event
        _EventTimerSchedule();
        
        for (;;) {
            // Wait for _EventTimer to fire
            _EventTimer::Wait();
            _EventHandle(_EventPop());
        }
    }
    
    static inline struct __State {
        __State() {} // Compiler bug workaround
        // live=false while initializing, where we execute events in 'fast-forward' mode,
        // solely to arrive at the correct state for the current time.
        // live=true once we're done initializing and executing events normally.
        bool live = false;
        // power / vddb / vddImgSd: our power assertions
        // These need to be ivars because _TaskEvent can be reset at any time via
        // our Reset() function, so if the power assertion lived on the stack and
        // _TaskEvent is reset, its destructor would never be called and our state
        // would be corrupted.
        _VDDBEnabled::Assertion vddb;
        _VDDIMGSDEnabled::Assertion vddImgSd;
    } _State;
    
    // Task stack
    SchedulerStack(".stack._TaskEvent")
    static inline uint8_t Stack[256];
};

static void _TaskEventRunningChanged() {
    if (_On::Asserted() && !_HostMode::Asserted()) {
        _TaskEvent::Start();
    } else {
        _TaskEvent::Reset();
    }
    _TaskMotionRunningChanged();
}

static void _HostModeChanged() {
    _TaskEventRunningChanged();
}

// MARK: - _TaskMotion

struct _TaskMotion {
    static void Start() {
        _Scheduler::Start<_TaskMotion>();
    }
    
    static void Reset() {
        _Motion::Reset();
        _Scheduler::Stop<_TaskMotion>();
    }
    
    static void Run() {
        Toastbox::IntState ints(false);
        
        _Motion::Init();
        
        for (;;) {
            if (!_Scheduler::Running<_TaskMotion>()) return;
            
            _Motion::WaitForMotion();
            // When motion occurs, start captures for each enabled motion trigger
            for (auto it=_Triggers::MotionTriggerBegin(); it!=_Triggers::MotionTriggerEnd(); it++) {
                _Triggers::MotionTrigger& trigger = *it;
                // If this trigger is enabled...
                if (trigger.enabled.get()) {
                    const Time::Instant time = _RTC::Now();
                    // Start capture
                    _TaskEvent::CaptureStart(trigger, time);
                    // Suppress motion for the specified duration, if suppression is enabled
                    const uint32_t suppressTicks = trigger.base().suppressTicks;
                    if (suppressTicks) {
                        trigger.enabled.suppress(true);
                        _TaskEvent::EventInsert((_Triggers::MotionUnsuppressEvent&)trigger, time, suppressTicks);
                    }
                }
            }
        }
    }
    
    // Task stack
    SchedulerStack(".stack._TaskMotion")
    static inline uint8_t Stack[128];
};

static void _TaskMotionRunningChanged() {
    if (_Scheduler::Running<_TaskEvent>() && _MotionEnabled::Asserted()) {
        _TaskMotion::Start();
    } else {
        _TaskMotion::Reset();
    }
}

// MARK: - _TaskI2C

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until STM is up (ie we're plugged in and charging)
            _Scheduler::Wait([] { return _Charging::Charging(); });
            
            _I2C::Init();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                // Send response
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
            // Relinquish LEDs, which may have been set by _CmdHandle()
            _LEDRed_.set(_LEDPriority::I2C, std::nullopt);
            _LEDGreen_.set(_LEDPriority::I2C, std::nullopt);
            
            // Reset state
            _HostModeState = {};
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::None:
            return MSP::Resp{ .ok = false };
        
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.off;
            if (off > sizeof(::_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&::_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.off;
            if (off > sizeof(::_State)) return MSP::Resp{ .ok = false };
            FRAMWriteEn writeEn; // Enable FRAM writing
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&::_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.red);
            _LEDGreen_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
