toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static void Run() {
        _Init();
        
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            _Pin::LED_RED_::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//        }
        
//        for (bool on_=0;; on_=!on_) {
////            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        _On = true;
//        for (bool on_=false;; on_=!on_) {
////            __delay_cycles(1000000);
////            _Pin::LED_GREEN_::Write(on_);
////            _EventTimer::Schedule(_RTC::Now() + 5*Time::TicksFreq::num);
////            _Scheduler::Wait([] { return _EventTimer::Fired(); });
//            
//            const auto nextTime = _Triggers::EventFront()->time;
//            const auto currTime = _RTC::Now();
//            
//            _Scheduler::Sleep(_Scheduler::Ms<1000>);
//        }
        
        
        
//        _On = true;
//        for (bool on_=false;; on_=!on_) {
////            __delay_cycles(1000000);
////            _Pin::LED_GREEN_::Write(on_);
//            _EventTimer::Schedule(_RTC::Now() + 5*Time::TicksFreq::num);
//            _Scheduler::Wait([] { return _EventTimer::Fired(); });
//        }
        
//        for (bool on_=false;; on_=!on_) {
//            _Pin::LED_GREEN_::Write(on_);
//            _Scheduler::Sleep(_Scheduler::Ms<1000>);
//        }
        
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            _Pin::LED_GREEN_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            
//            if (_Clock::_ClockFaults()) {
//                _Pin::LED_RED_::Write(0);
//            } else {
//                _Pin::LED_GREEN_::Write(0);
//            }
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        for (;;) {
////            _LEDRed_.set(_LEDPriority::Power, !_LEDRed_.get());
//            _Pin::LED_RED_::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            
//            _Pin::LED_RED_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        for (;;) {
////            _LEDRed_.set(_LEDPriority::Power, !_LEDRed_.get());
//            _Pin::LED_RED_::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            
//            _Pin::LED_RED_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
        static bool charging = false;
        for (;;) {
            // Button needs interrupts to be disabled
            Toastbox::IntState ints(false);
            
            // Wait for a button press, or for the charging state to change
            _Button::Reset();
            _Scheduler::Wait([] { return _Button::EventPending() || charging!=_Charging::Charging(); });
            
            // Handle button presses
            if (_Button::EventPending()) {
                switch (_Button::EventRead()) {
                case _Button::Event::Press: {
                    // Ignore button presses if we're off or in host mode
                    if (!_On || _HostMode::Asserted()) break;
                    
                    for (auto it=_Triggers::ButtonTriggerBegin(); it!=_Triggers::ButtonTriggerEnd(); it++) {
                        _TaskEvent::CaptureStart(*it, _RTC::Now());
                    }
                    break;
                }
                
                case _Button::Event::Hold:
                    _On = !_On;
                    break;
                }
            
            // Handle charging state changes
            } else {
                charging = _Charging::Charging();
                // Turn ourself on when we're plugged in
                if (charging) _On = true;
            }
        }
    }
    
    static void Sleep() {
        // Put ourself to sleep until an interrupt occurs
        
        // Enable/disable SysTick depending on whether we have tasks that are waiting for a deadline to pass.
        // We do this to prevent ourself from waking up unnecessarily, saving power.
        _SysTick = _Scheduler::TickRequired();
        
        // We consider the sleep 'extended' if SysTick isn't needed during the sleep
//        const bool extendedSleep = false;
//        const bool extendedSleep = true;
        const bool extendedSleep = !_SysTick;
        _Clock::Sleep(extendedSleep);
        
        // Unconditionally enable SysTick while we're awake
        _SysTick = true;
    }
    
    // _On: controls user-visible on/off behavior
    static inline ::_On::Assertion _On;
    
    // _SysTickEnabled: controls whether the SysTick timer is enabled
    // We disable SysTick when going to sleep if no tasks are waiting for a certain amount of time to pass
    static inline _SysTickEnabled::Assertion _SysTick;
    
    // Task stack
    static constexpr auto& Stack = _TaskMainStack;
};

// MARK: - IntState

inline bool Toastbox::IntState::Get() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::Set(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

// MARK: - Sleep

static void _Sleep() {
    _TaskMain::Sleep();
}

// MARK: - Interrupts

[[gnu::interrupt]]
void _ISR_RTC() {
    // Pet the watchdog first
    _Watchdog::Init();
    
    // Let _RTC know that we got an RTC interrupt
    _RTC::ISR(RTCIV);
    
    // Let _EventTimer know we got an RTC interrupt
    const bool wake = _EventTimer::ISRRTC();
    // Wake if the timer fired
    if (wake) _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_TIMER0_A1() {
    const bool wake = _EventTimer::ISRTimer(TA0IV);
    
//    _Pin::LED_RED_::Write(1);
//    for (;;) {
//        _Pin::LED_RED_::Write(1);
//        __delay_cycles(1000000);
//        _Pin::LED_RED_::Write(0);
//        __delay_cycles(1000000);
//    }
    
    // Wake if directed
    if (wake) _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_TIMER1_A1() {
//    _Pin::LED_GREEN_::Write(!_Pin::LED_GREEN_::Read());
    const bool wake = _SysTick::ISR(TA1IV);
    // Wake if directed
    if (wake) _Clock::Wake();
}

[[gnu::interrupt]]
void _ISR_PORT2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    const uint16_t iv = P2IV;
    switch (iv) {
    
    // Motion
    case _Pin::MOTION_SIGNAL::IVPort2():
        _Motion::ISR();
        // Wake ourself
        _Clock::Wake();
        break;
    
